Programming
===========
/*
	+ Êîíñòðóêòîð îò êîýôôèöèåíòîâ
	+ Êîíñòðóêòîð îò ïîëÿðíûõ êîîðäèíàò
	+ Äåñòðóêòîð
	+ Êîïèðóþùèé êîíñòðóêòîð
	+ Îïåðàòîð êîïèðóþùåãî ïðèñâàèâàíèÿ
	- Ìåòîä, ïîçâîëÿþùèé îïðåäåëèòü, ïåðåñåêàåò ëè äàííàÿ ïðÿìàÿ äðóãóþ
	- Ìåòîä, ïîçâîëÿþùèé îïðåäåëèòü, ëåæèò ëè äàííàÿ ïðÿìàÿ â îäíîé ïëîñêîñòè ñ äðóãîé
	- Ìåòîä, ïîçâîëÿþùèé îïðåäåëèòü, ëåæèò ëè òî÷êà íà äàííîé ïðÿìîé
	- Îïåðàòîð ââîäà èç ïîòîêà ââîäà
	- Îïåðàòîð âûâîäà èç ïîòîêà âûâîäà
*/

#include <iostream>

int main(void)
{
	setlocale(0, "Russian");
	Line line1(1, 2, 3, 4);
	//	...
	return 0;
}
